//기존 배열에 새로운 배열을 추가해 새로운 배열을 만든다.
concat 

//배열의 모든 요소가 주어진 함수에 대해  true라면 true를 반환, 아니라면 false를 반환
every

//배열의 요소 중 주어진 필터링 함수에 대해 true인 요소만 골라 새로운 배열을 만든다.
filter

//배열의 모든 요소에 대해 주어진 함수를 실행
forEach

//주어진 값과 일치하는 값이 있는 배열 요소의 첫 인덱스를 찾는다.
 indexOf

 //배열 요소를 문자열로 합친다. 이때 구분자를 지정할 수 있다.
 join

 //배열의 마지막 요소를 꺼내 그 값을 반환한다.
 pop

 //배열의 맨 끝에 새로운 요소를 추가한 후 새로운 length를 반환한다.
 push

 //배열의 배치 순서를 역순으로 바꾼다.
 reverse

 //배열에서 첫번째 요소를 꺼내 그 값을 반환한다.
 shift

 //배열에서 특정한 부분만 추출한다. 기존 배열은 바뀌지 않는다.
 slice

 //배열 요소를 지정한 조건에 따라 정렬한다.
 sort

 //배열에 요소를 추가하거나 특정 부분을 추출한다.
 splice

 //배열에서 지정한 부분을 문자열로 반환한다. 이때 각 요소는 쉼표로 구분한다.
 toString

 //배열의 시작 부분에 새로운 요소를 추가한다.
 unshift